In [2]:
%cd ../../../fake-profile-detection

f:\Projects\fake-profile-detection

# Setup

In [4]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

In [7]:
def reconfig_feature_list(feature_list, id_col):
    if feature_list == 'all':
        return feature_list
    elif feature_list is None:
        return [id_col]
    elif isinstance(feature_list, list):
        return feature_list + [id_col]
    else:
        raise TypeError('user_features or tweet_metadata_features is not valid')

In [8]:
from src.data_read import LocalFileReader

file_reader = LocalFileReader()
config = file_reader.get_mib_config()
id_col = 'id'
user_id_col = 'user_id'
label_col = 'label'
user_features = 'all'
user_features = reconfig_feature_list(None, id_col)
tweet_features = reconfig_feature_list(None, user_id_col)

use_user = (len(user_features) != 1)
use_tweet_metadata = (len(tweet_features) != 1)
use_tweet = False

## Run with old method

In [9]:
dict_read_mib = file_reader.read_mib(
    config,
    'label',
    use_user,
    use_tweet,
    use_tweet_metadata
)
dict_read_mib.keys()
for key, dfs in dict_read_mib.items():
    print(key)
    for k, v in dfs.items():
        print(k, v.shape if v is not None else 'None')
        v.head(1) if v is not None else None

dict_keys(['train', 'dev', 'test'])

train
user_df (5631, 43)

,id,name,screen_name,statuses_count,followers_count,friends_count,favourites_count,listed_count,url,lang,...,description,contributors_enabled,following,created_at,timestamp,crawled_at,updated,test_set_1,test_set_2,label
1545,2352917684,Naida Speciale,NaidaSpeciale,76,11,44,0,0,NaN,en,...,NaN,NaN,NaN,2014-02-20 08:15:08,2014-02-20 09:15:08,2014-05-05 00:20:21,2016-03-15 15:05:05,NaN,NaN,1

tweet_df None
tweet_metadata_df None
dev
user_df (938, 43)

,id,name,screen_name,statuses_count,followers_count,friends_count,favourites_count,listed_count,url,lang,...,description,contributors_enabled,following,created_at,timestamp,crawled_at,updated,test_set_1,test_set_2,label
3369,2354094438,Cecelia Osawa,CeceliaOsawa,71,4,39,0,0,NaN,en,...,NaN,NaN,NaN,2014-02-21 02:31:25,2014-02-21 03:31:25,2014-05-05 00:21:42,2016-03-15 15:14:53,NaN,NaN,1

tweet_df None
tweet_metadata_df None
test
user_df (2817, 43)

,id,name,screen_name,statuses_count,followers_count,friends_count,favourites_count,listed_count,url,lang,...,description,contributors_enabled,following,created_at,timestamp,crawled_at,updated,test_set_1,test_set_2,label
9103,514061230,Amarendra,sona15148758k,3,1,7,1,0,NaN,en,...,NaN,NaN,NaN,Sun Mar 04 07:26:06 +0000 2012,2012-03-04 08:26:06,2015-05-01 13:24:57,2016-03-15 16:09:57,0.0,0.0,0

tweet_df None
tweet_metadata_df None

## New method
Read first, split later

In [10]:
dict_no_split = file_reader.read_mib_no_split(
    config,
    'label',
    use_user,
    use_tweet,
    use_tweet_metadata
)
dict_no_split.keys()
for key, df in dict_no_split.items():
    print(key, df.shape if df is not None else 'None')
    df.head(1) if df is not None else None

dict_keys(['user_df', 'tweet_df', 'tweet_metadata_df'])

user_df (9386, 43)

,id,name,screen_name,statuses_count,followers_count,friends_count,favourites_count,listed_count,url,lang,...,description,contributors_enabled,following,created_at,timestamp,crawled_at,updated,test_set_1,test_set_2,label
0,24858289,Davide Bertoli,davideb66,1299,22,40,1,0,NaN,it,...,NaN,NaN,NaN,2009-03-17 08:51:12,2009-03-17 09:51:12,2014-04-19 14:46:19,2016-03-15 14:12:22,1.0,NaN,1

tweet_df None
tweet_metadata_df None

In [13]:
dict_after_split = file_reader.split_dfs(dict_no_split)
for key, dfs in dict_after_split.items():
    print(key)
    for k, v in dfs.items():
        print(k, v.shape if v is not None else 'None')
        v.head(1) if v is not None else None

train
user_df (5631, 43)

,id,name,screen_name,statuses_count,followers_count,friends_count,favourites_count,listed_count,url,lang,...,description,contributors_enabled,following,created_at,timestamp,crawled_at,updated,test_set_1,test_set_2,label
1545,2352917684,Naida Speciale,NaidaSpeciale,76,11,44,0,0,NaN,en,...,NaN,NaN,NaN,2014-02-20 08:15:08,2014-02-20 09:15:08,2014-05-05 00:20:21,2016-03-15 15:05:05,NaN,NaN,1

tweet_df None
tweet_metadata_df None
dev
user_df (938, 43)

,id,name,screen_name,statuses_count,followers_count,friends_count,favourites_count,listed_count,url,lang,...,description,contributors_enabled,following,created_at,timestamp,crawled_at,updated,test_set_1,test_set_2,label
3369,2354094438,Cecelia Osawa,CeceliaOsawa,71,4,39,0,0,NaN,en,...,NaN,NaN,NaN,2014-02-21 02:31:25,2014-02-21 03:31:25,2014-05-05 00:21:42,2016-03-15 15:14:53,NaN,NaN,1

tweet_df None
tweet_metadata_df None
test
user_df (2817, 43)

,id,name,screen_name,statuses_count,followers_count,friends_count,favourites_count,listed_count,url,lang,...,description,contributors_enabled,following,created_at,timestamp,crawled_at,updated,test_set_1,test_set_2,label
9103,514061230,Amarendra,sona15148758k,3,1,7,1,0,NaN,en,...,NaN,NaN,NaN,Sun Mar 04 07:26:06 +0000 2012,2012-03-04 08:26:06,2015-05-01 13:24:57,2016-03-15 16:09:57,0.0,0.0,0

tweet_df None
tweet_metadata_df None

# Compare algos
Make sure result is same as expected

In [24]:
for k_out in ['train', 'dev', 'test']:
    for k_in in ['user_df', 'tweet_df', 'tweet_metadata_df']:
        algo1_result = dict_read_mib[k_out][k_in]
        algo2_result = dict_after_split[k_out][k_in]
        if algo1_result is None:
            if algo2_result == algo1_result: continue
            else: raise Exception("in-equal algo")
        if not algo1_result.equals(algo2_result):
            raise Exception("in-equal algo")

# Compare runtime

In [36]:
file_reader = LocalFileReader()

In [37]:
%%timeit
dict_read_mib = file_reader.read_mib(
    config,
    'label',
    use_user,
    use_tweet,
    use_tweet_metadata
)

1.17 s ± 51.5 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [38]:
file_reader = LocalFileReader()

In [39]:
%%timeit
dict_no_split = file_reader.read_mib_no_split(
    config,
    'label',
    use_user,
    use_tweet,
    use_tweet_metadata
)
dict_split = file_reader.split_dfs(dict_no_split)

1.14 s ± 35.8 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

## Result
Similar Performance but 2nd approach is modular, better for EDA